# for those who didn’t notice what language he writes in

# many have had situations when you write a text,
# then look and realize that you forgot to change the keyboard layout

# 25.04.24 v1.0 rus/eng   eng/rus

# do not mix text with different languages

# example:
# ьн тфьу ьфкл <-->  my name mark   |     this is right 
# ьн тфьу марк <--> KeyError |     it is not right



dict = {
#basic
    ' ': ' ', 
    '1': '1',
    '2': '2',
    '3': '3',
    '4': '4',
    '5': '5', 
    '6': '6',
    '7': '7',
    '8': '8',
    '9': '9',
    '0': '0', 

    '(': '(',
    ')': ')', 
    '*': '*',
    '%': '%', 
    '!': '!',
 

    '-': '-',
    '=': '=', 
    '_': '_',
    '+': '+',
   
    #ver

    '{': 'Х', 
    '}': 'Ъ',
    '[': 'х',
    ']': 'ъ',
    '<': 'Б',
    '>': 'Ю', 
    ':': 'Ж',
    '"': 'Э', 

    'Х': '{',
    'Ъ': '}',
    'х': '[',
    'ъ': ']',
    'Б': '<', 
    'Ю': '>',
    'Ж': ':',
    'Э': '"', 
   
#ver


 #rus->eng
    'Й': 'Q', 
    'Ц': 'W',
    'У': 'E',
    'К': 'R',
    'Е': 'T',
    'Н': 'Y',
    'Г': 'U',
    'Ш': 'I',
    'Щ': 'O',
    'З': 'P',
    'Ф': 'A',
    'Ы': 'S', 
    'В': 'D',
    'А': 'F',
    'П': 'G',
    'Р': 'H',
    'О': 'J',
    'Л': 'K', 
    'Д': 'L',
    'Я': 'Z',
    'Ч': 'X',
    'С': 'C', 
    'М': 'V',
    'И': 'B',
    'Т': 'N',
    'Ь': 'M', 
   

    'й': 'q', 
    'ц': 'w',
    'у': 'e',
    'к': 'r',
    'е': 't',
    'н': 'y',
    'г': 'u', 
    'ш': 'i',
    'щ': 'o',
    'з': 'p',
    'х': '[',
    'ъ': ']',
    'ф': 'a', 
    'ы': 's',
    'в': 'd',
    'а': 'f',
    'п': 'g',
    'р': 'h',
    'о': 'j', 
    'л': 'k',
    'д': 'l',
    'ж': ';',
    'э': "'",
    'я': 'z',
    'ч': 'x',
    'с': 'c',
    'м': 'v',
    'и': 'b', 
    'т': 'n',
    'ь': 'm',
    'б': ',',
    'ю': '.',
    '.': '/',
    'ё': '`',

    '"': '@',
    '№': '#',
    ';': '$',
    ':': '^',
    '?': '.',

#eng->rus
    'Q': 'Й', 
    'W': 'Ц',
    'E': 'У',
    'R': 'К',
    'T': 'Е',
    'Y': 'Н',
    'U': 'Г',
    'I': 'Ш',
    'O': 'Щ',
    'P': 'З',
    'A': 'Ф',
    'S': 'Ы', 
    'D': 'В',
    'F': 'А',
    'G': 'П',
    'H': 'Р',
    'J': 'О',
    'K': 'Л', 
    'L': 'Д',
    'Z': 'Я',
    'X': 'Ч',
    'C': 'С', 
    'V': 'М',
    'B': 'И',
    'N': 'Т',
    'M': 'Ь', 

    'q': 'й', 
    'w': 'ц',
    'e': 'у',
    'r': 'к',
    't': 'е',
    'y': 'н',
    'u': 'г', 
    'i': 'ш',
    'o': 'щ',
    'p': 'з',
    '[': 'х',
    ']': 'ъ',
    'a': 'ф', 
    's': 'ы',
    'd': 'в',
    'f': 'а',
    'g': 'п',
    'h': 'р',
    'j': 'о', 
    'k': 'л',
    'l': 'д',
    ';': 'ж',
    "'": "э",
    'z': 'я',
    'x': 'ч',
    'c': 'с',
    'v': 'м',
    'b': 'и', 
    'n': 'т',
    'm': 'ь',
    ',': 'б',
    '.': 'ю',
    '/': '.',
    '`': 'ё', 

    '@': '"',
    '#': '№',
    '$': ';',
    '^': ':',
    '&': '?',
   
}



text = input()

new_text = ''.join([dict[s] for s in text])
print(new_text)